# GetColumnWidth Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableSectionData..::..GetColumnWidth Method
TableSectionData Class See Also
---
Returns a column's width in feet
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double GetColumnWidth(
	int nCol
)
```

Visual Basic
---
```text
Public Function GetColumnWidth ( _
	nCol As Integer _
) As Double
```

Visual C++
---
```text
public:
double GetColumnWidth(
	int nCol
)
```

# ### Parameters
nCol
    Type: System..::..Int32
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The given column number nCol is invalid. |

# See Also
TableSectionData Class
Autodesk.Revit.DB Namespace